#include <stdio.h>
#include <stdlib.h>

int main()
{
    int a[100], g[100], g1[100], g2[100], p[100], b[100], A[100], B[100], A1[100], B1[100], A2[100], B2[100];
    for (int i = 0; i<100; i++){
        a[i] = 100;
        g[i] = 100;
        p[i] = 100;
        b[i] = 100;
        A[i] = 100;
        B[i] = 100;
        A1[i] = 100;
        B1[i] = 100;
        A2[i] = 100;
        B2[i] = 100;
    }
    a[0] = 6;
    b[0] = 5;
    b[1] = 1;
    p[0] = 3;
    p[1] = 2;
    g[0] = 5;
    int uu = 0, ky = 0;
    while(p[uu]!=100){         //провека на деления на ноль
        if (p[uu] != 0)
            ky++;
        uu++;
    }
    system("chcp 1251");           // вывод чисел сформированных случайным образом
    system("cls");                 // вывод чисел сформированных случайным образом
    printf("Число Алисы: \n");    // вывод чисел сформированных случайным образом
    uu = 0;
    while(a[uu] !=100){
        printf("%d, a[uu]");
        uu++;
    }
    printf("Число Боба: \n");     // вывод чисел сформированных случайным образом
    uu = 0;
    while(a[uu] !=100){
        printf("%d, a[uu]");
        uu++;
    }
    printf("Число возводящееся в степень: \n");    // вывод чисел сформированных случайным образом
    uu = 0;
    while(a[uu] !=100){
        printf("%d, a[uu]");
        uu++;
    }
    printf("Число остаткка на деление: \n");       // вывод чисел сформированных случайным образом
    uu = 0;
    while(a[uu] !=100){
        printf("%d, a[uu]");
        uu++;
    }
    for (int ppp = 0; g[ppp] != 100; ppp++)     // заполненме массива аналогичными цифрами для возведения в степень
        g1[ppp] = g[ppp];
    int i = 0, j = 0, e = 0, k = 0, w1, w2;
    while ((a[0]-1) > i){
        j = 0;

        while (g[e] != 100){
        while (g1[j] != 100){      // увеличение степени на 1
            if (g1[j+n] == 100){
                g1[j+n] = 0;
            }
            g1[j + n] = g1[j]*g[e];
            j++;
        }
        n++;
        e++;
        }

        j = 0;
        while(g1[j]!=100){      // распределение цифр по ячейкам массива
            w1 = g1[j] / 10;
            w2 = g1[j] % 10;
            if (g1[j+1] != 100){
                g1[j] = w2;
                g1[j+1] = g1[j+1] + w1;
            }
            else {
                if (w1 !=0){
                    g1[j] = w2;
                    g1[j+1] = 0;
                    g1[j+1] = w1;
                }
                if (w1 == 0){
                    g1[j] = w2;
                }
            }
            j++;
        }

        i++;
    }

    int t = g1[j], p1 = 23, z = 0, h[100], hh1;
    while (j >= 0){          // выполнение деления
        if((t - p1)>=0){
            while((t - p1)>=0){
                t = t - p1;
                h[z] = h[z] + 1;
            }
            z++;
        }
        if ((j-1)<0){
            t = t * 10 + g1[j-1];
        }
        else{
            hh1 = t;
        }
        j--;
    }


    printf("\n\n");
    while (z >0){
            z--;
        printf("%d ", h[z]);

    }
    printf("\n\n");
    printf("%d\n ", hh1);
    return 0;
}

