#include <stdio.h>
#include <stdlib.h>

int main()
{
    int a[100], b[100], p[100], g[100], g2[100], g3[100];
    for (int r = 0; r<100; r++){
        a[r] = 100;
        g[r] = 100;
        p[r] = 100;
        b[r] = 100;
        g2[r] = 0;
        g3[r] = 0;
    }
    a[0] = 6;
    b[0] = 5;
    b[1] = 1;
    p[0] = 3;
    p[1] = 2;
    g[0] = 5;
    system("chcp 1251");           // вывод чисел сформированных случайным образом
    system("cls");                 // вывод чисел сформированных случайным образом
    printf("Число Алисы: ");     // вывод чисел сформированных случайным образом
    massivprint1(a);
    printf("Число Боба: ");     // вывод чисел сформированных случайным образом
    massivprint1(b);
    printf("Число возводящееся в степень: ");    // вывод чисел сформированных случайным образом
    massivprint1(g);
    printf("Число остатка на деление: ");       // вывод чисел сформированных случайным образом
    massivprint1(p);
    int i = 0, e = 0, n = 0, kk = 0, j, bb = 0, w1, w2, r;
    while(g[bb] != 100){
        bb++;
    }
    while((a[0]-1)>i){
        j = 0;
        e = 0;
        while(e<=bb){
            j = 0;
            while(g[j] != 100){  // увеличение степени и занесенение во временный массив g2 для последующего распределения в конечный массив g3

            g2[j + n] = g[j]*g[e];
            j++;
        }
        n++;
        e++;
        j = 0;
        while(g2[j] != 100){      // распределение цифр по ячейкам массива
            if (g2[j]>9){
            w1 = g2[j] / 10;
            w2 = g2[j] % 10;
            }
            else{
                w2 = g2[j];
                w1 = 0;
            }
            if (g2[j+1] != 100){
                g2[j] = w2;
                g2[j+1] = g2[j+1] + w1;
            }
            else {
                if (w1 !=0){
                    g2[j] = w2;
                    g2[j+1] = 0;
                    g2[j+1] = w1;
                }
                if (w1 == 0){
                    g2[j] = w2;
                }
            }
            j++;
        }
        while(g2[kk] != 100){      // заполнение финального массива
            g3[kk] = g3[kk] + g2[kk];
            kk++;
        }
        kk = 0;
        r = 0;
        for(r = 0; r <= n; r++){
            g2[r] = 0;
        }
        while(g2[kk]!=100){ // обнуление переменного массива для последующего произведения числа на однуиз его цифр
            g2[kk] = 0;
            kk++;
        }
        kk = 0;
        }
        j = 0;
        while(g3[j]!=100){      // распределение цифр по ячейкам конечного массива ДОРАБОТАТЬ!!!!
            w1 = g3[j] / 10;
            w2 = g3[j] % 10;
            if (g3[j+1] != 100){
                g3[j] = w2;
                g3[j+1] = g3[j+1] + w1;
            }
            else {
                if (w1 !=0){
                    g3[j] = w2;
                    g3[j+1] = 0;
                    g3[j+1] = w1;
                }
                if (w1 == 0){
                    g3[j] = w2;
                }
            }
            j++;
        }
        i++;
        n = 0;
    }
    return 0;
}

void massivprint1 (int a[]){
    int i = 0;
    while(a[i] != 100){
        i++;
    }
    i--;
    while(i >= 0){
        printf("%d", a[i]);
        i--;
    }
    printf("\n\n");
}

void massivprint2 (int a[]){
    int i = 0;
    while(a[i] != 0){
        printf("%d", a[i]);
        i++;
    }
}

void massivprint3 (int a[]){
    int i = 0;
    while((a[i] != 0) & (a[i+1] != 0)){
        i++;
    }
    while(i >= 0){
        printf("%d", a[i]);
        i--;
    }
    printf("\n\n");
}
